{
  "name": "Rayan Barreddine",
  "title": "Étudiant en 4e année à l'UTC, spécialité Intelligence Artificielle & Data",
  "bio": "Étudiant en dernière année à l'UTC, passionné par l'IA, la data science et l'innovation technologique. Expérience en gestion de projets, développement de solutions intelligentes et leadership d'équipe.",
  "about": "Je combine une solide formation en ingénierie informatique à l'UTC avec une forte implication dans des projets techniques et associatifs. Mes expériences couvrent la gestion de projets, le développement d'applications IA/data, la recherche, et l'encadrement d'équipes. Je me distingue par ma capacité à mener des projets de bout en bout, mon adaptabilité et mon esprit d'équipe.",
  "photo_path": "/images/1.png",
  "skills": [
    {
      "category": "Langages de programmation",
      "technologies": [
        "Python",
        "C",
        "C++",
        "HTML",
        "CSS",
        "PHP",
        "SQL",
        "R",
        "Lisp",
        "OCaml"
      ],
      "description": "Maîtrise avancée de plusieurs langages pour le développement web, l'analyse de données et l'IA."
    },
    {
      "category": "Intelligence Artificielle & Data Science",
      "technologies": [
        "Pandas",
        "NumPy",
        "scikit-learn",
        "TensorFlow",
        "PowerBI",
        "Azure",
        "AWS",
        "PostgreSQL",
        "Linux"
      ],
      "description": "Expertise en machine learning, deep learning, manipulation et visualisation de données, cloud et outils data."
    },
    {
      "category": "Gestion de projets",
      "technologies": [
        "AGILE",
        "SCRUM",
        "PBS",
        "WBS",
        "PDP",
        "OBS",
        "GANTT",
        "Business Plan"
      ],
      "description": "Gestion de projets complexes, planification, suivi et animation d'équipes pluridisciplinaires."
    }
  ],
  "projects": [
    {
      "id": "hive-cpp",
      "title": "Jeu de société HIVE en C++",
      "description": "Développement en C++ du jeu de société Hive avec une architecture orientée objet et une interface graphique interactive conçue avec Qt.",
      "details": "1. Utilisation de plusieurs design patterns (Factory, Strategy, Observer,...) pour structurer la logique du jeu et faciliter les extensions.\n2. Modélisation fine des pièces et règles via une hiérarchie de classes, respectant les principes SOLID.\n3. Système de vérification de la connectivité de la ruche implémenté avec des algorithmes de parcours de graphe.\n4. Séparation nette entre moteur de jeu et interface grâce à une architecture optimisée.\n5. Interface Qt dynamique avec gestion des événements utilisateur, animations et mise à jour temps réel de l'état du plateau.",
      "technologies": [
        "C++",
        "Qt",
        "Programmation orientée objet",
        "Patrons de conception"
      ],
      "photos": [],
      "video": "https://www.youtube.com/watch?v=example1",
      "location": "UTC",
      "period": "2023",
      "photo_path": "/images/projects/placeholder.svg"
    },
    {
      "id": "adit-search",
      "title": "Moteur de recherche sur des bulletins de l'ADIT",
      "description": "Développement complet d'un moteur de recherche en Python appliqué à un corpus de bulletins ADIT, intégrant correction orthographique, lemmatisation, indexation inversée et interface graphique.",
      "details": "1. Nettoyage du corpus HTML et transformation en XML structuré, avec extraction fine des métadonnées.\n2. Construction d'un anti-dictionnaire basé sur le score tf-idf, renforcé par une analyse statistique (loi de Zipf-Mandelbrot).\n3. Indexation optimisée via lemmatisation spaCy et normalisation des entités par distance de Levenshtein.\n4. Traitement avancé des requêtes en langage naturel via analyse de patterns et conversion en JSON.\n5. Interface web interactive en Dash, avec tri par pertinence/date, et moteur évalué avec des métriques de précision, rappel et F1.",
      "technologies": [
        "Python",
        "SpaCy",
        "Snowball",
        "JSON",
        "XML",
        "Dash"
      ],
      "photos": [],
      "video": "https://www.youtube.com/watch?v=example2",
      "location": "UTC",
      "period": "2023",
      "photo_path": "/images/projects/placeholder.svg"
    },
    {
      "id": "financial-prediction",
      "title": "Outil de prédiction sur les marchés financiers",
      "description": "Plateforme intelligente de gestion de portefeuille financier, combinant optimisation mathématique, prédiction des marchés et automatisation des décisions selon le profil de risque de l'utilisateur.",
      "details": "1. Intègre des modèles de machine learning (Random Forest, LSTM, ARIMA) pour anticiper les variations de prix avec validation croisée.\n2. Propose une gestion manuelle ou automatique des portefeuilles, avec ajustements dynamiques toutes les 5 minutes.\n3. Calcule en continu les performances (rendement, volatilité, Sharpe) et optimise les allocations via scipy.optimize.\n4. Offre une interface réactive via Dash, avec gestion en temps réel des actions, alertes de risque, et visualisations.\n5. Sécurise les données et assure la robustesse du système via une architecture modulaire, un cache, des sauvegardes persistantes, et une gestion fine des erreurs.",
      "technologies": [
        "Python",
        "Machine Learning",
        "Random Forest",
        "LSTM",
        "ARIMA",
        "SciPy",
        "TensorFlow",
        "Dash"
      ],
      "photos": [],
      "video": "https://www.youtube.com/watch?v=example3",
      "location": "UTC",
      "period": "2024",
      "photo_path": "/images/projects/placeholder.svg"
    },
    {
      "id": "pokemon-rag",
      "title": "RAG sur Pokémon",
      "description": "Système de RAG spécialisé sur l'univers Pokémon, combinant données structurées issues de PokéAPI et contenus textuels de Poképédia, avec une interface Streamlit interactive.",
      "details": "1. Collecte hybride : fusion de données textuelles et structurées, avec nettoyage, filtrage et indexation pour optimiser la pertinence et la performance.\n2. Architecture orientée objet : encapsulation complète du système dans une classe RAGSystem, respectant les principes SOLID.\n3. Base vectorielle avec ChromaDB: vectorisation des documents, gestion des modes de réponse (normal vs engagé) et nettoyage automatique des ressources.\n4. Interface Streamlit : système interactif avec réglage de la température, affichage des passages utilisés, détection des hallucinations et outil d'évaluation intégré.\n5. Évaluation fine : mesures RAGAS et internes (faithfulness, context precision, relevancy...), comparaison des modes, et pistes d'amélioration identifiées (hybrid search, enrichissement du corpus, tuning des prompts).",
      "technologies": [
        "Python",
        "Retrieval-Augmented Generation (RAG)",
        "ChromaDB",
        "Streamlit",
        "Google Gemini",
        "LLM"
      ],
      "photos": [],
      "video": "https://www.youtube.com/watch?v=example4",
      "location": "UTC",
      "period": "2024",
      "photo_path": "/images/projects/placeholder.svg"
    },
    {
      "id": "driving-school",
      "title": "Site de gestion d'auto-école",
      "description": "Application web PHP/MySQL complète pour la gestion des élèves, séances et inscriptions avec interface moderne.",
      "details": "- Sécurité assurée grâce aux requêtes préparées, à la validation serveur et à la gestion fine des erreurs.\n- Interface moderne en design sombre, responsive et animée pour une navigation fluide et intuitive.\n- Gestion complète des données : inscription avec vérification, suivi des notes et calendrier intégré.\n- Base de données relationnelle solide avec contraintes d'intégrité et gestion des capacités.\n- Fonctions avancées incluant désinscription, validation des séances et aperçus dynamiques des données.",
      "technologies": [
        "HTML",
        "CSS",
        "PHP",
        "SQL",
        "MySQL"
      ],
      "photos": [],
      "video": "https://www.youtube.com/watch?v=example5",
      "location": "UTC",
      "period": "2023",
      "photo_path": "/images/projects/placeholder.svg"
    }
  ],
  "experience": [
    {
      "title": "Chef de Projet",
      "company": "Junior UTC",
      "location": "Compiègne, France",
      "period": "Janvier 2025 - Septembre 2025",
      "description": "Encadrement du projet du premier contact client au rendu du livrable final. Supervision des projets clients, coordination des équipes et rédaction des documents contractuels.",
      "technologies": [
        "Gestion de projet",
        "Management",
        "Coordination d'équipe",
        "Rédaction contractuelle"
      ],
      "photo_path": "/images/jutc_logo.jpg"
    },
    {
      "title": "Chargé des Ressources Humaines",
      "company": "Junior UTC",
      "location": "Compiègne, France",
      "period": "Juin 2024 – Janvier 2025",
      "description": "Gestion du recrutement et de l'intégration des nouveaux membres. Organisation des formations et suivi du développement de 32 membres. Animation de la cohésion interne via 11 événements.",
      "technologies": [
        "Recrutement",
        "Formation",
        "Communication interne",
        "Organisation d'événements"
      ],
      "photo_path": "/images/jutc_logo.jpg"
    },
    {
      "title": "Opérateur de Conditionnement (stage ouvrier)",
      "company": "L’Oréal B.R.I",
      "location": "Lassigny, France",
      "period": "Été 2023",
      "description": "Contrôle qualité et conditionnement de 50 000 produits par semaine sur plusieurs chaînes de production. Participation à la production de produits pour une valeur totale de 2 000 000 euros par semaine.",
      "technologies": [
        "Contrôle qualité",
        "Production industrielle",
        "Travail en équipe"
      ],
      "photo_path": "/images/loreal.png"
    }
  ],
  "education": [
    {
      "title": "Diplôme d'ingénieur (prévu en 2027)",
      "company": "Université de Technologie de Compiègne (UTC)",
      "location": "Compiègne",
      "period": "Depuis Février 2023",
      "description": "Branche Informatique (filière Intelligence Artificielle et sciences des données).",
      "photo_path": "/images/utc.png"
    },
    {
      "title": "Classes Préparatoires aux Grandes Écoles (MP2I/MPI) (classé 13e/38)",
      "company": "Lycée Louis Thuillier",
      "location": "Amiens",
      "period": "Septembre 2021 – Février 2023",
      "description": "Formation approfondie en mathématiques, en physique et en informatique.",
      "photo_path": ""
    }
  ],
  "certifications": [
    "Professional Scrum Product Owner 1 (SCRUM)",
    "Kaggle Contributor",
    "Introduction à la finance d’entreprise (The Wharton School, University of Pennsylvania)"
  ],
  "languages": [
    {
      "language": "Français",
      "level": "Natif"
    },
    {
      "language": "Anglais",
      "level": "Courant"
    },
    {
      "language": "Allemand",
      "level": "B1"
    }
  ],
  "hobbies": [
    "Course à pied",
    "Trail",
    "Tennis",
    "Football",
    "Musique",
    "Jeux vidéo"
  ],
  "contact": {
    "email": "rayan.barre@icloud.com",
    "linkedin": "https://www.linkedin.com/in/rayan-barreddine/",
    "github": "https://github.com/RaaaayN",
    "phone": "+33 7 82 59 80 57"
  },
  "cv_path": "/cv/CV_Rayan_Barreddine.pdf",
  "location": "Erquery, France",
  "stats": {
    "experience_years": 3,
    "people_led": 15,
    "study_years": 4
  }
}
